
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'anyenv'
brew 'aom'
brew 'assimp'
brew 'assimp@5'
brew 'autoconf'
brew 'bat'
brew 'berkeley-db@5'
brew 'bison'
brew 'brotli'
brew 'bzip2'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'cask'
brew 'coreutils'
brew 'curl'
brew 'dbus'
brew 'docker-compose'
brew 'double-conversion'
brew 'emacs'
brew 'fd'
brew 'fish'
brew 'fontconfig'
brew 'freetype'
brew 'fribidi'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'ghostscript'
brew 'giflib'
brew 'glib'
brew 'gmp'
brew 'gnuplot'
brew 'gnutls'
brew 'graphite2'
brew 'grep'
brew 'gumbo-parser'
brew 'harfbuzz'
brew 'highway'
brew 'hunspell'
brew 'icu4c@76'
brew 'icu4c@77'
brew 'icu4c@78'
brew 'imath'
brew 'isl'
brew 'jansson'
brew 'jasper'
brew 'jbig2dec'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'krb5'
brew 'latexindent'
brew 'lazygit'
brew 'leptonica'
brew 'libarchive'
brew 'libavif'
brew 'libb2'
brew 'libcerf'
brew 'libdeflate'
brew 'libedit'
brew 'libevent'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libiconv'
brew 'libidn'
brew 'libidn2'
brew 'libmaxminddb'
brew 'libmng'
brew 'libmpc'
brew 'libnghttp2'
brew 'libnghttp3'
brew 'libngtcp2'
brew 'libpng'
brew 'libsmi'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libunistring'
brew 'libuv'
brew 'libvmaf'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxrender'
brew 'libzip'
brew 'litehtml'
brew 'little-cms2'
brew 'lpeg'
brew 'lua'
brew 'luajit'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'md4c'
brew 'mkcert'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'ncurses'
brew 'neovim'
brew 'nettle'
brew 'oniguruma'
brew 'openexr'
brew 'openjpeg'
brew 'openjph'
brew 'openssl@3'
brew 'p11-kit'
brew 'pango'
brew 'pcre2'
brew 'perl'
brew 'pixman'
brew 'pkgconf'
brew 'protobuf'
brew 'python-packaging'
brew 'python@3.13'
brew 'qt'
brew 'qt3d'
brew 'qt5compat'
brew 'qt@5'
brew 'qtbase'
brew 'qtcharts'
brew 'qtconnectivity'
brew 'qtdatavis3d'
brew 'qtdeclarative'
brew 'qtgraphs'
brew 'qtgrpc'
brew 'qthttpserver'
brew 'qtimageformats'
brew 'qtlanguageserver'
brew 'qtlocation'
brew 'qtlottie'
brew 'qtmultimedia'
brew 'qtnetworkauth'
brew 'qtpositioning'
brew 'qtquick3d'
brew 'qtquick3dphysics'
brew 'qtquickeffectmaker'
brew 'qtquicktimeline'
brew 'qtremoteobjects'
brew 'qtscxml'
brew 'qtsensors'
brew 'qtserialbus'
brew 'qtserialport'
brew 'qtshadertools'
brew 'qtspeech'
brew 'qtsvg'
brew 'qttools'
brew 'qttranslations'
brew 'qtvirtualkeyboard'
brew 'qtwebchannel'
brew 'qtwebengine'
brew 'qtwebsockets'
brew 'qtwebview'
brew 're2c'
brew 'readline'
brew 'ripgrep'
brew 'rtmpdump'
brew 'socat'
brew 'speexdsp'
brew 'sqlite'
brew 'tesseract'
brew 'tidy-html5'
brew 'tmux'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'uv'
brew 'webp'
brew 'wget'
brew 'wireshark'
brew 'xorgproto'
brew 'xz'
brew 'zlib'
brew 'zstd'

tap 'homebrew/cask'
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'cursor'
cask 'deepl'
cask 'displaylink'
cask 'docker'
cask 'fantastical'
cask 'font-antic-didone'
cask 'font-great-vibes'
cask 'font-hack-nerd-font'
cask 'font-julius-sans-one'
cask 'font-parisienne'
cask 'font-pompiere'
cask 'font-zen-maru-gothic'
cask 'google-chrome'
cask 'keyboardcleantool'
cask 'keycastr'
cask 'notion'
cask 'readdle-spark'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'webex'
cask 'zoom'

tap 'homebrew/bundle'

tap 'homebrew/services'

tap 'daipeihust/tap'
brew 'im-select'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'Keynote (14.4)', id: 409183694
mas 'LINE (9.12.1)', id: 539883307
mas 'Xcode (16.2)', id: 497799835
