tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "anyenv"
brew "libpng"
brew "openssl@1.1"
brew "autoconf"
brew "bison"
brew "bzip2"
brew "pcre2"
brew "pkg-config"
brew "curl"
brew "gcc"
brew "icu4c"
brew "gnuplot"
brew "jpeg"
brew "krb5"
brew "latexindent"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libzip"
brew "neovim"
brew "oniguruma"
brew "openssl@3"
brew "tidy-html5"
brew "php"
brew "re2c"
brew "socat"
brew "tmux"
brew "wget"
brew "zlib"
brew "daipeihust/tap/im-select"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "asana"
cask "deepl"
cask "discord"
cask "docker"
cask "fantastical"
cask "font-great-vibes"
cask "font-julius-sans-one"
cask "font-parisienne"
cask "font-pompiere"
cask "google-chrome"
cask "keycastr"
cask "notion"
cask "pushplaylabs-sidekick"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "webex"
cask "zoom"
