tap "daipeihust/tap"
tap "rcmdnk/file"
# All in one for **env
brew "anyenv"
# Library for manipulating PNG images
brew "libpng"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Automatic configure script builder
brew "autoconf"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Freely available high-quality data compressor
brew "bzip2"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Incremental parsing library
brew "tree-sitter"
# Emacs dependency management
brew "cask"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Isolated development environments using Docker
brew "docker-compose"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Network authentication protocol
brew "krb5"
# GNOME XML library
brew "libxml2"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Command-driven, interactive function plotting
brew "gnuplot"
# GNU grep, egrep and fgrep
brew "grep"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Image manipulation library
brew "jpeg"
# Add indentation to LaTeX files
brew "latexindent"
# Simple terminal UI for git commands
brew "lazygit"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Libosmium-based command-line tool for processing OpenStreetMap data
brew "osmium-tool"
# Core utilities for Python packages
brew "python-packaging"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Cross-platform application and UI framework
brew "qt@5"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SOcket CAT: netcat on steroids
brew "socat"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# General-purpose lossless data-compression library
brew "zlib"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# Brewfile manager for Homebrew.
brew "rcmdnk/file/brew-file"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Write, edit, and chat about your code with AI
cask "cursor"
# AI-powered translator
cask "deepl"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Calendar software
cask "fantastical"
cask "font-antic-didone"
cask "font-great-vibes"
cask "font-hack-nerd-font"
cask "font-julius-sans-one"
cask "font-parisienne"
cask "font-pompiere"
cask "font-zen-maru-gothic"
# Web browser
cask "google-chrome"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Open-source keystroke visualiser
cask "keycastr"
# App to write, plan, collaborate, and get organised
cask "notion"
# Email client
cask "readdle-spark"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "webex"
# Video communication and virtual meeting platform
cask "zoom"
vscode "alefragnani.project-manager"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "amirmarmul.laravel-blade-vscode"
vscode "anthropic.claude-code"
vscode "austenc.laravel-blade-spacer"
vscode "bmewburn.vscode-intelephense-client"
vscode "chakrounanas.turbo-console-log"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.path-intellisense"
vscode "codingyu.laravel-goto-view"
vscode "ctf0.laravel-goto-config"
vscode "ctf0.laravel-goto-controller"
vscode "ctf0.laravel-goto-view"
vscode "ctf0.php-array-symbols"
vscode "dariofuzinato.vue-peek"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "hollowtree.vue-snippets"
vscode "james-yu.latex-workshop"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "namesmt.blade-php"
vscode "naoray.laravel-goto-components"
vscode "neilbrayfield.php-docblocker"
vscode "octref.vetur"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "openai.chatgpt"
vscode "pdconsec.vscode-print"
vscode "pgl.laravel-jump-controller"
vscode "pkief.material-icon-theme"
vscode "pucelle.vscode-css-navigation"
vscode "ryannaddy.laravel-artisan"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wmaurer.change-case"
vscode "xabikos.javascriptsnippets"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
npm "@openai/codex"
npm "corepack"
npm "npm-check-updates"
